addons/binding/org.openhab.binding.ihc.test/src/test/resources/GetDetectedDeviceListResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:getDetectedDeviceList1 xmlns:ns1="utcs">
<ns1:arrayItem xsi:type="ns1:WSRFDevice">
<ns1:batteryLevel xsi:type="xsd:int">1</ns1:batteryLevel>

<ns1:deviceType xsi:type="xsd:int">2049</ns1:deviceType>

<ns1:serialNumber xsi:type="xsd:long">123456789</ns1:serialNumber>

<ns1:signalStrength xsi:type="xsd:int">10</ns1:signalStrength>

<ns1:version xsi:type="xsd:int">1</ns1:version>

<ns1:detected xsi:type="xsd:boolean">true</ns1:detected>
</ns1:arrayItem>
</ns1:getDetectedDeviceList1>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>